#+TITLE: Reference Sequences
#+PROPERTY:  header-args :var DIR=(file-name-directory buffer-file-name)


* Marine Dolphin Mitochondrial References

  All complete marine dolphin mitochondrial genomes from RefSeq were downloaded
  to [[./marine_dolphin.refseq.fasta]].

  #+name: marine-dolphin-mito
  #+caption: Accessions and species of the complete marine dolphin (/Delphinidae/) mitochondria publicly available from RefSeq
  | Accession   | Species                    |
  |-------------+----------------------------|
  | NC_050265.1 | Lagenorhynchus acutus      |
  | NC_045404.1 | Sousa teuszii              |
  | NC_042761.1 | Steno bredanensis          |
  | NC_037848.1 | Lagenodelphis hosei        |
  | NC_036415.1 | Delphinus delphis          |
  | NC_035426.1 | Lagenorhynchus obliquidens |
  | NC_032301.1 | Stenella longirostris      |
  | NC_019578.2 | Globicephala macrorhynchus |
  | NC_023889.1 | Orcinus orca               |
  | NC_022805.1 | Tursiops australis         |
  | NC_020696.1 | Cephalorhynchus heavisidii |
  | NC_019591.1 | Orcaella heinsohni         |
  | NC_019590.1 | Orcaella brevirostris      |
  | NC_019589.1 | Peponocephala electra      |
  | NC_019588.1 | Feresa attenuata           |
  | NC_019577.1 | Pseudorca crassidens       |
  | NC_019441.1 | Globicephala melas         |
  | NC_005278.1 | Lagenorhynchus albirostris |
  | NC_012062.1 | Grampus griseus            |
  | NC_012059.1 | Tursiops truncatus         |
  | NC_012051.1 | Stenella attenuata         |
  | NC_012061.1 | Delphinus capensis         |
  | NC_012058.1 | Tursiops aduncus           |
  | NC_012057.1 | Sousa chinensis            |
  | NC_012053.1 | Stenella coeruleoalba      |

#+begin_src bash :var accessions=marine-dolphin-mito[,0] :results ignore
PATH=~/.local/edirect/:$PATH
IFS=,

efetch -db nuccore -id "${accessions[*]}" -format fasta \
    > marine_dolphin.refseq.fasta
#+end_src

#+RESULTS:

  - Create database from marine dolphins
    #+begin_src sh :results output
ml singularity/3.5.2 blast

makeblastdb -dbtype nucl -in $DIR/marine_dolphin.refseq.fasta
    #+end_src

    #+RESULTS:
    #+begin_example
  Building a new DB, current time: 12/16/2021 20:38:08
  New DB name:   /work/maa146/dolphin/0-ref/marine_dolphin.refseq.fasta
  New DB title:  /work/maa146/dolphin//0-ref/marine_dolphin.refseq.fasta
  Sequence type: Nucleotide
  Deleted existing Nucleotide BLAST database named /work/maa146/dolphin/0-ref/marine_dolphin.refseq.fasta
  Keep MBits: T
  Maximum file size: 1000000000B
  Adding sequences from FASTA; added 25 sequences in 0.0162878 seconds.
    #+end_example



